# Carga de datos a través de la función read_csv

In [0]:
import pandas as pd

In [0]:
mainpath = "https://raw.githubusercontent.com/santiliaudat/python-ml-course/master/datasets"
filename = "/titanic/titanic3.csv"
fullname = mainpath + filename

In [0]:
df = pd.read_csv(fullname)

In [24]:
df.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

# Ejemplos de los parámetros de la función read_csv
read_csv(filepath="/Users/santi/archivo.csv", sep = ",", dtype={"ingresos":np.float64, "edad":np.int32}, header=0,names={"ingresos", "edad"}, skiprows=12, index_col=None, 
skip_blank_lines=False, na_filter=False )

In [0]:
df2 = pd.read_csv(mainpath + "/customer-churn-model/Customer%20Churn%20Model.txt")

In [28]:
df2.head()

  State  Account Length  Area Code  ... Intl Charge CustServ Calls  Churn?
0    KS             128        415  ...        2.70              1  False.
1    OH             107        415  ...        3.70              1  False.
2    NJ             137        415  ...        3.29              0  False.
3    OH              84        408  ...        1.78              2  False.
4    OK              75        415  ...        2.73              3  False.

[5 rows x 21 columns]

In [29]:
df2.columns.values

array(['State', 'Account Length', 'Area Code', 'Phone', "Int'l Plan",
       'VMail Plan', 'VMail Message', 'Day Mins', 'Day Calls',
       'Day Charge', 'Eve Mins', 'Eve Calls', 'Eve Charge', 'Night Mins',
       'Night Calls', 'Night Charge', 'Intl Mins', 'Intl Calls',
       'Intl Charge', 'CustServ Calls', 'Churn?'], dtype=object)

In [36]:
df2_columns = pd.read_csv(mainpath + "/customer-churn-model/Customer%20Churn%20Columns.csv")
df2_columns_list = df2_columns["Column_Names"].tolist()
df2 = pd.read_csv(mainpath + "/customer-churn-model/Customer%20Churn%20Model.txt", header=None, names=df2_columns_list)
df2.columns.values

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
       'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U'], dtype=object)

# Carga de datos a través de la función open

In [0]:
localt_path = "Users/santi/datasets/"
df3 = open(localt_path + "/customer-churn-model/Customer%20Churn%20Model.txt", "r")

In [0]:
cols = df3.readline().strip().split(",")
n_cols = len(cols)

In [0]:
counter = 0
main_dict = {}
for col in cols:
    main_dict[col] = []

In [0]:
for line in df3:
    values = line.strip().split(",")
    for i in range(len(cols)):
        main_dict[cols[i]].append(values[i])
    counter += 1

print("El data set tiene %d filas y %d columnas"%(counter, n_cols))

In [0]:
# Convertir a dataframe
df3 = pd.DataFrame(main_dict)
df3.head()